In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [3]:
df = pd.DataFrame({
    'name':['홍길동','김개똥','김말자','국제','아카데미','홍1','홍2','홍3','홍4'],
    'ban':[1,3,1,1,3,2,4,2,3],
    'math':[98,23,56,11,78,88,99,100,11],
    'eng':[22,44,77,88,44,66,99,100,77]
})
df

   name  ban  math  eng
0   홍길동    1    98   22
1   김개똥    3    23   44
2   김말자    1    56   77
3    국제    1    11   88
4  아카데미    3    78   44
5    홍1    2    88   66
6    홍2    4    99   99
7    홍3    2   100  100
8    홍4    3    11   77

In [6]:
for idx,data in df.groupby('ban'):
    print(idx,data)
    print('===========')

1   name  ban  math  eng
0  홍길동    1    98   22
2  김말자    1    56   77
3   국제    1    11   88
===========
2   name  ban  math  eng
5   홍1    2    88   66
7   홍3    2   100  100
===========
3    name  ban  math  eng
1   김개똥    3    23   44
4  아카데미    3    78   44
8    홍4    3    11   77
===========
4   name  ban  math  eng
6   홍2    4    99   99
===========

In [7]:
df.groupby('ban').count()

     name  math  eng
ban
1       3     3    3
2       2     2    2
3       3     3    3
4       1     1    1

In [8]:
df.groupby('ban').count()['name']

ban
1    3
2    2
3    3
4    1
Name: name, dtype: int64

In [16]:
!pip install --upgrade pandas

Requirement already satisfied: pandas in c:\users\tj\anaconda3\lib\site-packages (2.1.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\tj\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\tj\anaconda3\lib\site-packages (from pandas) (1.26.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\tj\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tj\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\tj\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [19]:
df.groupby('ban')['math'].agg(['mean','sum','count'])

          mean  sum  count
ban
1    55.000000  165      3
2    94.000000  188      2
3    37.333333  112      3
4    99.000000   99      1

In [36]:
def user_fn(x):
    return str(sum(x))+'입니다.'+str(type(x))

In [51]:
def user_fn1(x):
    return {'a':sum(x),'b':str(sum(x))+'입니다.'}

In [57]:
for i in df.groupby('ban')['math'].agg(['mean','sum','count',user_fn,user_fn1])['user_fn1']:
    print(i['a'])

165
188
112
99

In [60]:
def even_fn(x):
    sum1=0
    for i in x:
        if i%2==0:
            sum1+=i
    return sum1

In [62]:
def odd_fn(x):
    sum1=0
    for i in x:
        if i%2==1:
            sum1+=i
    return sum1

In [63]:
df.groupby('ban')['math'].agg(['mean','sum','count',even_fn,odd_fn])

          mean  sum  count  even_fn  odd_fn
ban
1    55.000000  165      3      154      11
2    94.000000  188      2      188       0
3    37.333333  112      3       78      34
4    99.000000   99      1        0      99